---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinePatternElement
source: html/b196f8cc-e0c6-f83e-cc4e-f1de315fb1cc.htm
---
# LinePatternElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.